; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=109, out_folder=htg/blocksworld//training, instance_id=89, seed=2113

(define (problem blocksworld-89)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 - object)
 (:init 
    (arm-empty)
    (clear b12)
    (on b12 b59)
    (on-table b59)
    (clear b81)
    (on b81 b80)
    (on b80 b107)
    (on b107 b79)
    (on b79 b77)
    (on b77 b52)
    (on b52 b64)
    (on b64 b32)
    (on b32 b88)
    (on b88 b16)
    (on b16 b84)
    (on-table b84)
    (clear b101)
    (on b101 b8)
    (on b8 b14)
    (on b14 b7)
    (on-table b7)
    (clear b105)
    (on b105 b99)
    (on b99 b72)
    (on b72 b30)
    (on-table b30)
    (clear b35)
    (on b35 b28)
    (on-table b28)
    (clear b21)
    (on b21 b93)
    (on b93 b95)
    (on b95 b103)
    (on b103 b25)
    (on b25 b19)
    (on b19 b37)
    (on b37 b60)
    (on b60 b3)
    (on b3 b61)
    (on b61 b85)
    (on b85 b43)
    (on b43 b36)
    (on b36 b44)
    (on b44 b23)
    (on b23 b108)
    (on b108 b47)
    (on b47 b10)
    (on b10 b13)
    (on b13 b50)
    (on b50 b49)
    (on b49 b26)
    (on b26 b46)
    (on b46 b54)
    (on b54 b18)
    (on b18 b78)
    (on-table b78)
    (clear b20)
    (on b20 b6)
    (on b6 b53)
    (on-table b53)
    (clear b86)
    (on b86 b5)
    (on-table b5)
    (clear b63)
    (on b63 b76)
    (on b76 b97)
    (on b97 b58)
    (on b58 b29)
    (on b29 b90)
    (on b90 b73)
    (on b73 b45)
    (on b45 b91)
    (on b91 b102)
    (on-table b102)
    (clear b31)
    (on b31 b9)
    (on b9 b56)
    (on b56 b27)
    (on b27 b66)
    (on b66 b4)
    (on b4 b74)
    (on b74 b109)
    (on b109 b65)
    (on b65 b75)
    (on b75 b68)
    (on b68 b38)
    (on b38 b42)
    (on-table b42)
    (clear b51)
    (on b51 b87)
    (on b87 b67)
    (on b67 b83)
    (on b83 b57)
    (on-table b57)
    (clear b39)
    (on b39 b62)
    (on b62 b1)
    (on b1 b92)
    (on b92 b55)
    (on b55 b15)
    (on b15 b17)
    (on b17 b48)
    (on b48 b82)
    (on b82 b100)
    (on b100 b22)
    (on b22 b40)
    (on b40 b11)
    (on b11 b69)
    (on b69 b94)
    (on b94 b104)
    (on b104 b96)
    (on b96 b70)
    (on b70 b98)
    (on b98 b41)
    (on b41 b24)
    (on b24 b106)
    (on-table b106)
    (clear b71)
    (on b71 b89)
    (on b89 b34)
    (on b34 b33)
    (on b33 b2)
    (on-table b2))
 (:goal  (and 
    (clear b2)
    (on b2 b8)
    (on b8 b5)
    (on b5 b7)
    (on b7 b1)
    (on b1 b3)
    (on b3 b9)
    (on b9 b10)
    (on b10 b4)
    (on b4 b6)
    (on-table b6))))

; plan
1. (unstack b20 b6)
   deleted: (on b20 b6) (clear b20) (arm-empty)
   added: (holding b20) (clear b6)
   goals met: 0 of 11
2. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 11
3. (unstack b6 b53)
   deleted: (on b6 b53) (clear b6) (arm-empty)
   added: (holding b6) (clear b53)
   goals met: 0 of 11
4. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 11
5. (unstack b71 b89)
   deleted: (on b71 b89) (clear b71) (arm-empty)
   added: (holding b71) (clear b89)
   goals met: 1 of 11
6. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 1 of 11
7. (unstack b89 b34)
   deleted: (on b89 b34) (clear b89) (arm-empty)
   added: (holding b89) (clear b34)
   goals met: 1 of 11
8. (putdown b89)
   deleted: (holding b89)
   added: (clear b89) (arm-empty) (on-table b89)
   goals met: 1 of 11
9. (unstack b34 b33)
   deleted: (on b34 b33) (clear b34) (arm-empty)
   added: (holding b34) (clear b33)
   goals met: 1 of 11
10. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 1 of 11
11. (unstack b33 b2)
   deleted: (on b33 b2) (clear b33) (arm-empty)
   added: (holding b33) (clear b2)
   goals met: 2 of 11
12. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 2 of 11
13. (unstack b101 b8)
   deleted: (on b101 b8) (clear b101) (arm-empty)
   added: (holding b101) (clear b8)
   goals met: 2 of 11
14. (putdown b101)
   deleted: (holding b101)
   added: (clear b101) (arm-empty) (on-table b101)
   goals met: 2 of 11
15. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 1 of 11
16. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 3 of 11
17. (unstack b31 b9)
   deleted: (on b31 b9) (clear b31) (arm-empty)
   added: (holding b31) (clear b9)
   goals met: 3 of 11
18. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 3 of 11
19. (unstack b9 b56)
   deleted: (on b9 b56) (clear b9) (arm-empty)
   added: (holding b9) (clear b56)
   goals met: 3 of 11
20. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 11
21. (unstack b56 b27)
   deleted: (on b56 b27) (clear b56) (arm-empty)
   added: (holding b56) (clear b27)
   goals met: 3 of 11
22. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 3 of 11
23. (unstack b27 b66)
   deleted: (on b27 b66) (clear b27) (arm-empty)
   added: (holding b27) (clear b66)
   goals met: 3 of 11
24. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 3 of 11
25. (unstack b66 b4)
   deleted: (on b66 b4) (clear b66) (arm-empty)
   added: (holding b66) (clear b4)
   goals met: 3 of 11
26. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 3 of 11
27. (unstack b4 b74)
   deleted: (on b4 b74) (clear b4) (arm-empty)
   added: (holding b4) (clear b74)
   goals met: 3 of 11
28. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 4 of 11
29. (unstack b21 b93)
   deleted: (on b21 b93) (clear b21) (arm-empty)
   added: (holding b21) (clear b93)
   goals met: 4 of 11
30. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 4 of 11
31. (unstack b93 b95)
   deleted: (on b93 b95) (clear b93) (arm-empty)
   added: (holding b93) (clear b95)
   goals met: 4 of 11
32. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 4 of 11
33. (unstack b95 b103)
   deleted: (on b95 b103) (clear b95) (arm-empty)
   added: (holding b95) (clear b103)
   goals met: 4 of 11
34. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 4 of 11
35. (unstack b103 b25)
   deleted: (on b103 b25) (clear b103) (arm-empty)
   added: (holding b103) (clear b25)
   goals met: 4 of 11
36. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 4 of 11
37. (unstack b25 b19)
   deleted: (on b25 b19) (clear b25) (arm-empty)
   added: (holding b25) (clear b19)
   goals met: 4 of 11
38. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 4 of 11
39. (unstack b19 b37)
   deleted: (on b19 b37) (clear b19) (arm-empty)
   added: (holding b19) (clear b37)
   goals met: 4 of 11
40. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 4 of 11
41. (unstack b37 b60)
   deleted: (on b37 b60) (clear b37) (arm-empty)
   added: (holding b37) (clear b60)
   goals met: 4 of 11
42. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 4 of 11
43. (unstack b60 b3)
   deleted: (on b60 b3) (clear b60) (arm-empty)
   added: (holding b60) (clear b3)
   goals met: 4 of 11
44. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 4 of 11
45. (unstack b3 b61)
   deleted: (on b3 b61) (clear b3) (arm-empty)
   added: (holding b3) (clear b61)
   goals met: 4 of 11
46. (stack b3 b9)
   deleted: (clear b9) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b9)
   goals met: 5 of 11
47. (unstack b39 b62)
   deleted: (on b39 b62) (clear b39) (arm-empty)
   added: (holding b39) (clear b62)
   goals met: 5 of 11
48. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 5 of 11
49. (unstack b62 b1)
   deleted: (on b62 b1) (clear b62) (arm-empty)
   added: (holding b62) (clear b1)
   goals met: 5 of 11
50. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 5 of 11
51. (unstack b1 b92)
   deleted: (on b1 b92) (clear b1) (arm-empty)
   added: (holding b1) (clear b92)
   goals met: 5 of 11
52. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 6 of 11
53. (unstack b61 b85)
   deleted: (on b61 b85) (clear b61) (arm-empty)
   added: (holding b61) (clear b85)
   goals met: 6 of 11
54. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 6 of 11
55. (unstack b85 b43)
   deleted: (on b85 b43) (clear b85) (arm-empty)
   added: (holding b85) (clear b43)
   goals met: 6 of 11
56. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 6 of 11
57. (unstack b43 b36)
   deleted: (on b43 b36) (clear b43) (arm-empty)
   added: (holding b43) (clear b36)
   goals met: 6 of 11
58. (stack b43 b95)
   deleted: (clear b95) (holding b43)
   added: (arm-empty) (clear b43) (on b43 b95)
   goals met: 6 of 11
59. (unstack b36 b44)
   deleted: (on b36 b44) (clear b36) (arm-empty)
   added: (holding b36) (clear b44)
   goals met: 6 of 11
60. (stack b36 b89)
   deleted: (clear b89) (holding b36)
   added: (arm-empty) (clear b36) (on b36 b89)
   goals met: 6 of 11
61. (unstack b44 b23)
   deleted: (on b44 b23) (clear b44) (arm-empty)
   added: (holding b44) (clear b23)
   goals met: 6 of 11
62. (stack b44 b27)
   deleted: (clear b27) (holding b44)
   added: (arm-empty) (clear b44) (on b44 b27)
   goals met: 6 of 11
63. (unstack b23 b108)
   deleted: (on b23 b108) (clear b23) (arm-empty)
   added: (holding b23) (clear b108)
   goals met: 6 of 11
64. (stack b23 b34)
   deleted: (clear b34) (holding b23)
   added: (arm-empty) (clear b23) (on b23 b34)
   goals met: 6 of 11
65. (unstack b108 b47)
   deleted: (on b108 b47) (clear b108) (arm-empty)
   added: (holding b108) (clear b47)
   goals met: 6 of 11
66. (stack b108 b85)
   deleted: (clear b85) (holding b108)
   added: (arm-empty) (clear b108) (on b108 b85)
   goals met: 6 of 11
67. (unstack b47 b10)
   deleted: (on b47 b10) (clear b47) (arm-empty)
   added: (holding b47) (clear b10)
   goals met: 6 of 11
68. (stack b47 b108)
   deleted: (clear b108) (holding b47)
   added: (arm-empty) (clear b47) (on b47 b108)
   goals met: 6 of 11
69. (unstack b10 b13)
   deleted: (on b10 b13) (clear b10) (arm-empty)
   added: (holding b10) (clear b13)
   goals met: 6 of 11
70. (stack b10 b4)
   deleted: (clear b4) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b4)
   goals met: 7 of 11
71. (unstack b86 b5)
   deleted: (on b86 b5) (clear b86) (arm-empty)
   added: (holding b86) (clear b5)
   goals met: 7 of 11
72. (stack b86 b56)
   deleted: (clear b56) (holding b86)
   added: (arm-empty) (clear b86) (on b86 b56)
   goals met: 7 of 11
73. (unstack b2 b8)
   deleted: (on b2 b8) (clear b2) (arm-empty)
   added: (holding b2) (clear b8)
   goals met: 5 of 11
74. (stack b2 b93)
   deleted: (clear b93) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b93)
   goals met: 6 of 11
75. (unstack b8 b14)
   deleted: (on b8 b14) (clear b8) (arm-empty)
   added: (holding b8) (clear b14)
   goals met: 6 of 11
76. (stack b8 b10)
   deleted: (clear b10) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b10)
   goals met: 6 of 11
77. (unstack b14 b7)
   deleted: (on b14 b7) (clear b14) (arm-empty)
   added: (holding b14) (clear b7)
   goals met: 6 of 11
78. (stack b14 b23)
   deleted: (clear b23) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b23)
   goals met: 6 of 11
79. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 6 of 11
80. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 7 of 11
81. (unstack b8 b10)
   deleted: (on b8 b10) (clear b8) (arm-empty)
   added: (holding b8) (clear b10)
   goals met: 7 of 11
82. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 8 of 11
83. (unstack b2 b93)
   deleted: (on b2 b93) (clear b2) (arm-empty)
   added: (holding b2) (clear b93)
   goals met: 7 of 11
84. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 9 of 11
85. (unstack b7 b1)
   deleted: (on b7 b1) (clear b7) (arm-empty)
   added: (holding b7) (clear b1)
   goals met: 8 of 11
86. (stack b7 b37)
   deleted: (clear b37) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b37)
   goals met: 8 of 11
87. (unstack b1 b3)
   deleted: (on b1 b3) (clear b1) (arm-empty)
   added: (holding b1) (clear b3)
   goals met: 7 of 11
88. (stack b1 b105)
   deleted: (clear b105) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b105)
   goals met: 7 of 11
89. (unstack b7 b37)
   deleted: (on b7 b37) (clear b7) (arm-empty)
   added: (holding b7) (clear b37)
   goals met: 7 of 11
90. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 8 of 11
91. (unstack b3 b9)
   deleted: (on b3 b9) (clear b3) (arm-empty)
   added: (holding b3) (clear b9)
   goals met: 7 of 11
92. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 7 of 11
93. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 7 of 11
94. (stack b9 b10)
   deleted: (clear b10) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b10)
   goals met: 8 of 11
95. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 8 of 11
96. (stack b3 b9)
   deleted: (clear b9) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b9)
   goals met: 9 of 11
97. (unstack b7 b1)
   deleted: (on b7 b1) (clear b7) (arm-empty)
   added: (holding b7) (clear b1)
   goals met: 8 of 11
98. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 11
99. (unstack b1 b105)
   deleted: (on b1 b105) (clear b1) (arm-empty)
   added: (holding b1) (clear b105)
   goals met: 8 of 11
100. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 9 of 11
101. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 9 of 11
102. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 10 of 11
103. (unstack b2 b8)
   deleted: (on b2 b8) (clear b2) (arm-empty)
   added: (holding b2) (clear b8)
   goals met: 8 of 11
104. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 9 of 11
105. (unstack b8 b5)
   deleted: (on b8 b5) (clear b8) (arm-empty)
   added: (holding b8) (clear b5)
   goals met: 8 of 11
106. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 8 of 11
107. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 8 of 11
108. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 9 of 11
109. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 9 of 11
110. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 10 of 11
111. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 9 of 11
112. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 11 of 11
